// if (MASK & 1) == 1 then
// 	jump to INTERRUPT_FUNCTION
// else
// 	continue
// ახსნა:
// 	ვიცით, რომ თავდაპირველად (პროგრამის ჩართვისას) Overflow Bit არის 0.
//	თუ ასეა, მაშინ INTERRUPT_FUNCTION-ზე არ გადავხტებით.
// 	თუ ტაიმერის მიერ წყვეტა მოხდა და ისე აღმოვჩნდით ამ ინსტრუქციაზე,
//	მაშინ Overflow Bit უნდა იყოს 1, ამიტომ გვეცოდინება რომ უნდა გადავხტეთ. 
//	არასდროს არ მოხდება ისე, რომ წყვეტა მოხდა და არ გადახტა.
//	არც ისე, რომ გადახტა წყვეტის გარეშე. 

S = A
S = D
@MASK
D = M
@INTERRUPT_FUNCTION
D & 1 ; JGT
D = S
A = S
